app/helpers/expenses_helper.rb

  def expense_img(expense)
    if expense.groups.first.nil?
      nil
    elsif expense.groups.first.icon.url.nil?
---
SELECT "groups".* FROM "groups" INNER JOIN "group_expenses" ON "groups"."id" = "group_expenses"."group_id" WHERE "group_expenses"."expense_id" = ? ORDER BY "groups"."id" ASC LIMIT ?  [["expense_id", 4], ["LIMIT", 1]]

  def add_exp_img(expense)
    if expense.groups.first.nil?
---
SELECT "groups".* FROM "groups" INNER JOIN "group_expenses" ON "groups"."id" = "group_expenses"."group_id" WHERE "group_expenses"."expense_id" = ? ORDER BY "groups"."id" ASC LIMIT ?  [["expense_id", 1], ["LIMIT", 1]]