app/helpers/groups_helper.rb

SELECT "expenses"."amount" FROM "expenses" INNER JOIN "group_expenses" ON "expenses"."id" = "group_expenses"."expense_id" WHERE "group_expenses"."group_id" = ?  [["group_id", 1]]
---
  def group_expense(group)
    group.expenses.pluck(:amount).sum