app/controllers/expenses_controller.rb

  def index
    @expenses = current_user.expenses.by_recent_created.page(params[:page]).per(3)
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ? ORDER BY created_at desc LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "expenses" WHERE "expenses"."user_id" = ?  [["user_id", 1]]

  def external_expense
    @expenses = Expense.external(current_user).by_user(current_user).by_recent_created.page(params[:page]).per(3)
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" NOT IN (?, ?, ?, ?) AND "expenses"."user_id" = ? ORDER BY created_at desc LIMIT ? OFFSET ?  [["id", 1], ["id", 3], ["id", 4], ["id", 6], ["user_id", 2], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "expenses" WHERE "expenses"."id" NOT IN (?, ?, ?, ?) AND "expenses"."user_id" = ?  [["id", 1], ["id", 3], ["id", 4], ["id", 6], ["user_id", 2]]

  def create
    if params_check
      @expense = current_user.expenses.build(expense_params)
      @expense.user_id = current_user.id
      respond_to do |format|
        if @expense.save
          format.html { redirect_to expenses_path, notice: 'Expense was successfully added.' }
        else
          format.html { render :new }
        end
      end
    elsif !params_check
      @expense = current_user.expenses.build(params_exempt)
      @expense.user_id = current_user.id
      respond_to do |format|
        if @expense.save
          format.html { redirect_to expenses_path, notice: 'Expense was successfully added.' }
        else
          format.html { render :new }
        end
      end
      @groups = Group.where(id: params_groups)
---
INSERT INTO "expenses" ("name", "amount", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "McDonalds"], ["amount", 20.0], ["created_at", "2021-01-09 08:49:50.607930"], ["updated_at", "2021-01-09 08:49:50.607930"], ["user_id", 1]]
INSERT INTO "expenses" ("name", "amount", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Journey"], ["amount", 10.0], ["created_at", "2021-01-09 14:10:23.131595"], ["updated_at", "2021-01-09 14:10:23.131595"], ["user_id", 2]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ?  [["id", 4]]

  def show
    @expense = Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def destroy
    respond_to do |format|
      if @expenses.destroy
---
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 1]]

  def set_expense_item
    @expenses = Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_group_item
    @groups = current_user.groups
---
SELECT "groups".* FROM "groups" INNER JOIN "group_expenses" ON "groups"."id" = "group_expenses"."group_id" WHERE "group_expenses"."expense_id" = ? ORDER BY "groups"."id" ASC LIMIT ?  [["expense_id", 1], ["LIMIT", 1]]