app/controllers/group_expenses_controller.rb

  def create
    GroupExpense.create(expense_id: @expense.id, group_id: @group.id)
---
INSERT INTO "group_expenses" ("created_at", "updated_at", "expense_id", "group_id") VALUES (?, ?, ?, ?)  [["created_at", "2021-01-09 14:04:46.241766"], ["updated_at", "2021-01-09 14:04:46.241766"], ["expense_id", 4], ["group_id", 3]]

  def destroy
    group_expense = GroupExpense.where(expense_id: @expense.id, group_id: @group.id).first
    group_expense.destroy
---
SELECT "group_expenses".* FROM "group_expenses" WHERE "group_expenses"."expense_id" = ? AND "group_expenses"."group_id" = ? ORDER BY "group_expenses"."id" ASC LIMIT ?  [["expense_id", 3], ["group_id", 3], ["LIMIT", 1]]
DELETE FROM "group_expenses" WHERE "group_expenses"."id" = ?  [["id", 2]]

  def set_group_item
    @group = Group.find(params[:group_id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def set_expense_item
    @expense = Expense.find(params[:expense_id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]