app/controllers/groups_controller.rb

  def index
    @groups = current_user.groups.by_alpha_order.page(params[:page]).per(3)
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = ? ORDER BY name asc LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "groups" WHERE "groups"."user_id" = ?  [["user_id", 1]]

  def create
    @group = Group.new(group_params)
    @group.user_id = current_user.id

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "Daily Expenses"], ["created_at", "2021-01-09 08:50:22.810924"], ["updated_at", "2021-01-09 08:50:22.810924"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE "groups" SET "icon" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["icon", 0.0], ["updated_at", "2021-01-09 14:05:20.436525"], ["id", 2]]

  def destroy
    @group.destroy
---
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 2]]

  def show
    @group = Group.find(params[:id])
    @grouped = @group.expenses.order('expenses.created_at desc').page(params[:page]).per(3)
    @ungrouped = Expense.external(current_user).by_user(current_user).by_recent_created.page(params[:page]).per(3)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" INNER JOIN "group_expenses" ON "expenses"."id" = "group_expenses"."expense_id" WHERE "group_expenses"."group_id" = ? ORDER BY expenses.created_at desc LIMIT ? OFFSET ?  [["group_id", 2], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "expenses" INNER JOIN "group_expenses" ON "expenses"."id" = "group_expenses"."expense_id" WHERE "group_expenses"."group_id" = ?  [["group_id", 2]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" NOT IN (?, ?) AND "expenses"."user_id" = ? ORDER BY created_at desc LIMIT ? OFFSET ?  [["id", 3], ["id", 4], ["user_id", 2], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "expenses" WHERE "expenses"."id" NOT IN (?, ?) AND "expenses"."user_id" = ?  [["id", 3], ["id", 4], ["user_id", 2]]

  def set_group_item
    @group = Group.find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]