app/models/expense.rb

SELECT "group_expenses"."expense_id" FROM "group_expenses" WHERE "group_expenses"."expense_id" IN (?, ?, ?, ?)  [["expense_id", 1], ["expense_id", 2], ["expense_id", 3], ["expense_id", 4]]
---
  scope :external, ->(user) { where.not(id: GroupExpense.where(expense_id: user.expenses.pluck(:id)).pluck(:expense_id)) }

INSERT INTO "group_expenses" ("created_at", "updated_at", "expense_id", "group_id") VALUES (?, ?, ?, ?)  [["created_at", "2021-01-09 14:10:52.354721"], ["updated_at", "2021-01-09 14:10:52.354721"], ["expense_id", 6], ["group_id", 4]]
---
  def add_expense_to_group(groups, expense)
    exp_groups = groups.pluck(:id)
    exp_groups.each do |group|
      GroupExpense.create!(expense_id: expense.id, group_id: group)